In [248]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [249]:
data = pd.read_csv('./Data/train_data.csv')

In [250]:
data

,Investor_ID,Age,Annual_Income,Investment_Amount,Risk_Tolerance_Score,Months_of_Investing_Experience,Number_of_Active_Investments,Potential_Return_Rate,Investment_Duration,Investment_to_Income_Ratio,Education,Employment_Status,Marital_Status,Owns_Property,Has_Dependents,Investment_Sector,Has_Investment_Advisor,Investment_Failed
0,0003HW9UAA,51.0,NaN,87300.0,358,13,3.0,18.10,12,0.85,Bachelor's,Part-time,NaN,No,NO,Other,True,0
1,000ELHLBPV,37.0,81658.0,152598.0,792,23,4.0,14.06,24,0.86,PhD,Self-employed,NaN,Yes,No,Auto,False,1
2,000G6CHJON,NaN,NaN,77767.0,359,57,4.0,4.31,60,0.60,Master's,Unemployed,Married,No,No,Education,True,0
3,000K09D0JB,54.0,42344.0,13261.0,366,115,1.0,NaN,60,0.21,PhD,Part-time,Divorced,No,No,Education,True,0
4,000NTH4YTU,63.0,48898.0,193990.0,792,53,4.0,5.65,48,0.82,Master's,Self-employed,Married,Yes,No,Business,True,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
225342,ZZZHT6VWO4,37.0,25394.0,NaN,527,12,2.0,NaN,24,0.17,Bachelor's,Unemployed,Married,Ye,Maybe,Education,False,1
225343,ZZZI5YOV9G,32.0,101616.0,101862.0,628,32,2.0,17.45,12,0.38,High School,Full-time,Single,Yes,no,Education,False,1
225344,ZZZMFPZFKE,NaN,102495.0,140375.0,764,82,4.0,23.82,24,0.63,High School,Full-time,Divorced,yes,No,Other,False,0
225345,ZZZV1HB132,69.0,143661.0,157929.0,407,38,4.0,6.07,60,0.33,Master's,Part-time,Divorced,Yes,Yes,Home,False,0
225346,ZZZX015LV2,65.0,114515.0,95500.0,820,45,4.0,8.87,48,0.13,High School,Full-time,Single,no,No,Business,False,0

In [251]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 225347 entries, 0 to 225346
Data columns (total 18 columns):
 #   Column                          Non-Null Count   Dtype
---  ------                          --------------   -----
 0   Investor_ID                     225347 non-null  object
 1   Age                             192507 non-null  float64
 2   Annual_Income                   202721 non-null  float64
 3   Investment_Amount               207314 non-null  float64
 4   Risk_Tolerance_Score            225347 non-null  int64
 5   Months_of_Investing_Experience  225347 non-null  int64
 6   Number_of_Active_Investments    220835 non-null  float64
 7   Potential_Return_Rate           214103 non-null  float64
 8   Investment_Duration             225347 non-null  int64
 9   Investment_to_Income_Ratio      225347 non-null  float64
 10  Education                       225347 non-null  object
 11  Employment_Status               225347 non-null  object
 12  Marital_Status                  182441 non-null  object
 13  Owns_Property                   225347 non-null  object
 14  Has_Dependents                  225347 non-null  object
 15  Investment_Sector               225347 non-null  object
 16  Has_Investment_Advisor          221498 non-null  object
 17  Investment_Failed               225347 non-null  int64
dtypes: float64(6), int64(4), object(8)
memory usage: 30.9+ MB

In [252]:
data.drop('Investor_ID',axis=1,inplace=True)

In [253]:
data["Marital_Status"].value_counts()

Marital_Status
Divorced    39174
Married     38979
Single      38886
Sgl         21918
Marr        21834
Div         21650
Name: count, dtype: int64

In [254]:
data["Marital_Status"].replace({"Sgl":"Single","Marr":"Married","Div":"Divorced"},inplace=True)

C:\Users\alisa\AppData\Local\Temp\ipykernel_11428\2061714600.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data["Marital_Status"].replace({"Sgl":"Single","Marr":"Married","Div":"Divorced"},inplace=True)

In [255]:
data["Marital_Status"].value_counts()

Marital_Status
Divorced    60824
Married     60813
Single      60804
Name: count, dtype: int64

In [256]:
data["Education"].value_counts()

Education
Bachelor's     56748
PhD            56258
Master's       56224
High School    56117
Name: count, dtype: int64

In [257]:
data["Employment_Status"].value_counts()

Employment_Status
Part-time        52525
Full-time        52378
Self-employed    52231
Unemployed       51838
Self              3912
Part              3872
Full              3860
Unem              3822
Retired            909
Name: count, dtype: int64

In [258]:
data["Employment_Status"].replace({"Self":"Self-employed","Part":"Part-time","Full":"Full-time","Unem":"Unemployed","Retired":"Retired"},inplace=True)

C:\Users\alisa\AppData\Local\Temp\ipykernel_11428\3864444157.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data["Employment_Status"].replace({"Self":"Self-employed","Part":"Part-time","Full":"Full-time","Unem":"Unemployed","Retired":"Retired"},inplace=True)

In [259]:
data["Employment_Status"].value_counts()

Employment_Status
Part-time        56397
Full-time        56238
Self-employed    56143
Unemployed       55660
Retired            909
Name: count, dtype: int64

In [260]:
# pkl data dataframe
data.to_pickle("data_cleaned.pkl")

In [261]:
data["Owns_Property"].value_counts()

Owns_Property
No         94232
Yes        85543
Ye          9388
no          8266
NO          8201
YES         7419
yes         7267
Maybe       1704
Unknown     1700
YE           821
ye           806
Name: count, dtype: int64

In [262]:
data["Owns_Property"].replace({"YE":"Yes","ye":"Yes","No":"No","Yes":"Yes","Ye":"Yes","no":"No","NO":"No","YES":"Yes","yes":"Yes","Maybe":"Unknown","Unknown":"Unknown"},inplace=True)

C:\Users\alisa\AppData\Local\Temp\ipykernel_11428\3897785005.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data["Owns_Property"].replace({"YE":"Yes","ye":"Yes","No":"No","Yes":"Yes","Ye":"Yes","no":"No","NO":"No","YES":"Yes","yes":"Yes","Maybe":"Unknown","Unknown":"Unknown"},inplace=True)

In [263]:
data["Owns_Property"].value_counts()

Owns_Property
Yes        111244
No         110699
Unknown      3404
Name: count, dtype: int64

In [264]:
data["Has_Dependents"].value_counts()

Has_Dependents
No         88990
Yes        71791
Ye         17469
no         10998
NO         10864
yes         8815
YES         8668
ye          2175
YE          2121
Maybe       1829
Unknown     1627
Name: count, dtype: int64

In [265]:
data["Has_Dependents"].replace({"YE":"Yes","ye":"Yes","No":"No","Yes":"Yes","Ye":"Yes","no":"No","NO":"No","yes":"Yes","YES":"Yes","ye":"Yes","YE":"Yes","Maybe":"Unknown"},inplace=True)

C:\Users\alisa\AppData\Local\Temp\ipykernel_11428\2079459505.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data["Has_Dependents"].replace({"YE":"Yes","ye":"Yes","No":"No","Yes":"Yes","Ye":"Yes","no":"No","NO":"No","yes":"Yes","YES":"Yes","ye":"Yes","YE":"Yes","Maybe":"Unknown"},inplace=True)

In [266]:
data["Has_Dependents"].value_counts()

Has_Dependents
Yes        111039
No         110852
Unknown      3456
Name: count, dtype: int64

In [267]:
data["Investment_Sector"].value_counts()

Investment_Sector
Home         45381
Business     45176
Education    44974
Other        44962
Auto         44854
Name: count, dtype: int64

In [268]:
data.to_pickle("data_cleaned.pkl")

In [269]:
data["Marital_Status"].value_counts()

Marital_Status
Divorced    60824
Married     60813
Single      60804
Name: count, dtype: int64

In [270]:
# Has_Investment_Advisor convert column to string
data["Has_Investment_Advisor"].astype(str)
data["Has_Investment_Advisor"].value_counts()

Has_Investment_Advisor
True     110975
False    110523
Name: count, dtype: int64

In [246]:
def marital_status(x):
    if x=="Married":
        return 1
    elif x=="Single":
        return 2
    elif x == "Divorced":
        return 0

def investment_advisor(x):
    if x==True:
        return 1
    elif x==False:
        return 0

In [271]:
data

,Age,Annual_Income,Investment_Amount,Risk_Tolerance_Score,Months_of_Investing_Experience,Number_of_Active_Investments,Potential_Return_Rate,Investment_Duration,Investment_to_Income_Ratio,Education,Employment_Status,Marital_Status,Owns_Property,Has_Dependents,Investment_Sector,Has_Investment_Advisor,Investment_Failed
0,51.0,NaN,87300.0,358,13,3.0,18.10,12,0.85,Bachelor's,Part-time,NaN,No,No,Other,True,0
1,37.0,81658.0,152598.0,792,23,4.0,14.06,24,0.86,PhD,Self-employed,NaN,Yes,No,Auto,False,1
2,NaN,NaN,77767.0,359,57,4.0,4.31,60,0.60,Master's,Unemployed,Married,No,No,Education,True,0
3,54.0,42344.0,13261.0,366,115,1.0,NaN,60,0.21,PhD,Part-time,Divorced,No,No,Education,True,0
4,63.0,48898.0,193990.0,792,53,4.0,5.65,48,0.82,Master's,Self-employed,Married,Yes,No,Business,True,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
225342,37.0,25394.0,NaN,527,12,2.0,NaN,24,0.17,Bachelor's,Unemployed,Married,Yes,Unknown,Education,False,1
225343,32.0,101616.0,101862.0,628,32,2.0,17.45,12,0.38,High School,Full-time,Single,Yes,No,Education,False,1
225344,NaN,102495.0,140375.0,764,82,4.0,23.82,24,0.63,High School,Full-time,Divorced,Yes,No,Other,False,0
225345,69.0,143661.0,157929.0,407,38,4.0,6.07,60,0.33,Master's,Part-time,Divorced,Yes,Yes,Home,False,0
225346,65.0,114515.0,95500.0,820,45,4.0,8.87,48,0.13,High School,Full-time,Single,No,No,Business,False,0

In [272]:
data["Marital_Status"]= data["Marital_Status"].apply(marital_status)
data["Marital_Status"].value_counts()

Marital_Status
0.0    60824
1.0    60813
2.0    60804
Name: count, dtype: int64

In [273]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 225347 entries, 0 to 225346
Data columns (total 17 columns):
 #   Column                          Non-Null Count   Dtype
---  ------                          --------------   -----
 0   Age                             192507 non-null  float64
 1   Annual_Income                   202721 non-null  float64
 2   Investment_Amount               207314 non-null  float64
 3   Risk_Tolerance_Score            225347 non-null  int64
 4   Months_of_Investing_Experience  225347 non-null  int64
 5   Number_of_Active_Investments    220835 non-null  float64
 6   Potential_Return_Rate           214103 non-null  float64
 7   Investment_Duration             225347 non-null  int64
 8   Investment_to_Income_Ratio      225347 non-null  float64
 9   Education                       225347 non-null  object
 10  Employment_Status               225347 non-null  object
 11  Marital_Status                  182441 non-null  float64
 12  Owns_Property                   225347 non-null  object
 13  Has_Dependents                  225347 non-null  object
 14  Investment_Sector               225347 non-null  object
 15  Has_Investment_Advisor          221498 non-null  object
 16  Investment_Failed               225347 non-null  int64
dtypes: float64(7), int64(4), object(6)
memory usage: 29.2+ MB

In [274]:
data["Education"].value_counts()

Education
Bachelor's     56748
PhD            56258
Master's       56224
High School    56117
Name: count, dtype: int64

In [275]:
data["Has_Investment_Advisor"].value_counts()

Has_Investment_Advisor
True     110975
False    110523
Name: count, dtype: int64

In [276]:
data["Has_Investment_Advisor"] = data["Has_Investment_Advisor"].apply(investment_advisor)
data["Has_Investment_Advisor"].value_counts()

Has_Investment_Advisor
1.0    110975
0.0    110523
Name: count, dtype: int64

In [277]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 225347 entries, 0 to 225346
Data columns (total 17 columns):
 #   Column                          Non-Null Count   Dtype
---  ------                          --------------   -----
 0   Age                             192507 non-null  float64
 1   Annual_Income                   202721 non-null  float64
 2   Investment_Amount               207314 non-null  float64
 3   Risk_Tolerance_Score            225347 non-null  int64
 4   Months_of_Investing_Experience  225347 non-null  int64
 5   Number_of_Active_Investments    220835 non-null  float64
 6   Potential_Return_Rate           214103 non-null  float64
 7   Investment_Duration             225347 non-null  int64
 8   Investment_to_Income_Ratio      225347 non-null  float64
 9   Education                       225347 non-null  object
 10  Employment_Status               225347 non-null  object
 11  Marital_Status                  182441 non-null  float64
 12  Owns_Property                   225347 non-null  object
 13  Has_Dependents                  225347 non-null  object
 14  Investment_Sector               225347 non-null  object
 15  Has_Investment_Advisor          221498 non-null  float64
 16  Investment_Failed               225347 non-null  int64
dtypes: float64(8), int64(4), object(5)
memory usage: 29.2+ MB

In [278]:
data["Marital_Status"].value_counts()

Marital_Status
0.0    60824
1.0    60813
2.0    60804
Name: count, dtype: int64

In [279]:
data["Has_Investment_Advisor"].value_counts()

Has_Investment_Advisor
1.0    110975
0.0    110523
Name: count, dtype: int64

In [280]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 225347 entries, 0 to 225346
Data columns (total 17 columns):
 #   Column                          Non-Null Count   Dtype
---  ------                          --------------   -----
 0   Age                             192507 non-null  float64
 1   Annual_Income                   202721 non-null  float64
 2   Investment_Amount               207314 non-null  float64
 3   Risk_Tolerance_Score            225347 non-null  int64
 4   Months_of_Investing_Experience  225347 non-null  int64
 5   Number_of_Active_Investments    220835 non-null  float64
 6   Potential_Return_Rate           214103 non-null  float64
 7   Investment_Duration             225347 non-null  int64
 8   Investment_to_Income_Ratio      225347 non-null  float64
 9   Education                       225347 non-null  object
 10  Employment_Status               225347 non-null  object
 11  Marital_Status                  182441 non-null  float64
 12  Owns_Property                   225347 non-null  object
 13  Has_Dependents                  225347 non-null  object
 14  Investment_Sector               225347 non-null  object
 15  Has_Investment_Advisor          221498 non-null  float64
 16  Investment_Failed               225347 non-null  int64
dtypes: float64(8), int64(4), object(5)
memory usage: 29.2+ MB

In [281]:
data.to_pickle("data_cleaned.pkl")

In [282]:
data

,Age,Annual_Income,Investment_Amount,Risk_Tolerance_Score,Months_of_Investing_Experience,Number_of_Active_Investments,Potential_Return_Rate,Investment_Duration,Investment_to_Income_Ratio,Education,Employment_Status,Marital_Status,Owns_Property,Has_Dependents,Investment_Sector,Has_Investment_Advisor,Investment_Failed
0,51.0,NaN,87300.0,358,13,3.0,18.10,12,0.85,Bachelor's,Part-time,NaN,No,No,Other,1.0,0
1,37.0,81658.0,152598.0,792,23,4.0,14.06,24,0.86,PhD,Self-employed,NaN,Yes,No,Auto,0.0,1
2,NaN,NaN,77767.0,359,57,4.0,4.31,60,0.60,Master's,Unemployed,1.0,No,No,Education,1.0,0
3,54.0,42344.0,13261.0,366,115,1.0,NaN,60,0.21,PhD,Part-time,0.0,No,No,Education,1.0,0
4,63.0,48898.0,193990.0,792,53,4.0,5.65,48,0.82,Master's,Self-employed,1.0,Yes,No,Business,1.0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
225342,37.0,25394.0,NaN,527,12,2.0,NaN,24,0.17,Bachelor's,Unemployed,1.0,Yes,Unknown,Education,0.0,1
225343,32.0,101616.0,101862.0,628,32,2.0,17.45,12,0.38,High School,Full-time,2.0,Yes,No,Education,0.0,1
225344,NaN,102495.0,140375.0,764,82,4.0,23.82,24,0.63,High School,Full-time,0.0,Yes,No,Other,0.0,0
225345,69.0,143661.0,157929.0,407,38,4.0,6.07,60,0.33,Master's,Part-time,0.0,Yes,Yes,Home,0.0,0
225346,65.0,114515.0,95500.0,820,45,4.0,8.87,48,0.13,High School,Full-time,2.0,No,No,Business,0.0,0

In [285]:
data["Age"] = data["Age"].fillna(data["Age"].mean())